wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/stripetoken-transaction-details-response.json

{
    "type": "transaction",
    "id": "random-transaction-id",
    "reconciliation_id": "random-reconcilliation-id",
    "merchant_account_id": "default",
    "currency": "USD",
    "amount": 100,
    "status": "capture_succeeded",
    "authorized_amount": 100,
    "captured_amount": 100,
    "refunded_amount": 0,
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "GB",
    "external_identifier": "123.4",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "approval_url": null,
        "country": null,
        "currency": null,
        "details": null,
        "expiration_date": null,
        "fingerprint": null,
        "label": "apple_pay_3366",
        "last_replaced_at": null,
        "method": "stripetoken",
        "mode": "redirect",
        "scheme": null,
        "id": "random-payment-method-id",
        "approval_target": null,
        "external_identifier": "random-payment-method-id",
        "payment_account_reference": null
    },
    "method": "stripetoken",
    "instrument_type": "redirect_token",
    "error_code": null,
    "payment_service": {
        "type": "payment-service",
        "id": "random-payment-service-id",
        "payment_service_definition_id": "stripe-stripetoken",
        "method": "stripetoken",
        "display_name": "Stripe Token (Fundraise Up)"
    },
    "pending_review": false,
    "buyer": {
        "type": "buyer",
        "id": "random-buyer-id",
        "display_name": "lorem@ipsum.co",
        "external_identifier": "random-customer-id",
        "billing_details": {
            "first_name": "lorem",
            "last_name": "ipsum",
            "email_address": "lorem@ipsum.co",
            "phone_number": null,
            "address": {
                "city": "TEST",
                "country": "GB",
                "postal_code": "TEST",
                "state": "TEST",
                "state_code": null,
                "house_number_or_name": null,
                "line1": "TEST",
                "line2": "TEST",
                "organization": null
            },
            "tax_id": null
        },
        "account_number": null
    },
    "raw_response_code": "approved_by_network",
    "raw_response_description": "Payment complete.",
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "created_at": "2025-09-08T13:46:02.210096+00:00",
    "updated_at": "2025-09-08T13:46:05.625316+00:00",
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "anti_fraud_decision": null,
    "payment_source": "recurring",
    "merchant_initiated": true,
    "is_subsequent_payment": true,
    "cart_items": [],
    "statement_descriptor": {
        "name": null,
        "description": "Wikimedia Foundation",
        "city": null,
        "country": null,
        "phone_number": null,
        "url": null
    },
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "random_payment_service_transaction_id",
    "additional_identifiers": {
        "payment_service_authorization_id": null,
        "payment_service_capture_id": null,
        "payment_service_processor_id": null
    },
    "metadata": null,
    "authorized_at": "2025-09-08T13:46:04.176789+00:00",
    "captured_at": "2025-09-08T13:46:05.553299+00:00",
    "voided_at": null,
    "canceled_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "succeeded",
    "multi_tender": false,
    "account_funding_transaction": false,
    "recipient": null,
    "merchant_advice_code": null,
    "installment_count": null
}